wsdl/com/ibm/sdp/services/charging/abstraction/ChargingServiceFlow_ChargingExport1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="ChargingExport1_ChargingHttp_Service" targetNamespace="http://ChargingProcess/com/ibm/sdp/services/charging/abstraction/Charging/Binding3" xmlns:Port_0="http://ChargingProcess/com/ibm/sdp/services/charging/abstraction/Charging" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:this="http://ChargingProcess/com/ibm/sdp/services/charging/abstraction/Charging/Binding3" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <wsdl:import namespace="http://ChargingProcess/com/ibm/sdp/services/charging/abstraction/Charging" location="Charging.wsdl">
    </wsdl:import>
  <wsdl:binding name="ChargingExport1_ChargingHttpBinding" type="Port_0:Charging">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="charge">
      <soap:operation soapAction=""/>
      <wsdl:input name="chargeRequest">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="chargeResponse">
        <soap:body use="literal"/>
      </wsdl:output>
      <wsdl:fault name="serviceException">
        <soap:fault name="serviceException" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="ChargingExport1_ChargingHttpService">
    <wsdl:port name="ChargingExport1_ChargingHttpPort" binding="this:ChargingExport1_ChargingHttpBinding">
      <soap:address location="http://MDSPOWER68.in.ibm.com:9081/ChargingServiceFlowWeb/sca/ChargingExport1"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
